16_Soap_faults_in_WCF/CalculatorClient/CalculatorClient/web_messages.svclog

<E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2016-03-16T21:58:37.5163245Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{0e5eea13-016e-4212-b08e-d9881dfaafda}" /><Execution ProcessName="iisexpress" ProcessID="6072" ThreadID="6" /><Channel/><Computer>GO-PC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2016-03-16T22:58:37.5133243+01:00" Source="TransportSend" Type="System.ServiceModel.Channels.BodyWriterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPo/9JDolyVxNNop2fuGmPMrcAAAAAo2n7OeuCgkyv0zGH+762BAigWWwi6bFBgR7DUXRHSdsACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing"><s:Header><a:Action s:mustUnderstand="1">http://tempuri.org/ICalculatorService/Divide</a:Action><a:MessageID>urn:uuid:c78a0e9e-1186-4eb8-8ba9-3be6e5125a23</a:MessageID><ActivityId CorrelationId="cd84bfe8-92a9-4c14-9244-749591296d6f" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">0e5eea13-016e-4212-b08e-d9881dfaafda</ActivityId><a:ReplyTo><a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address></a:ReplyTo><a:To s:mustUnderstand="1">http://localhost:8080/CalculatorService</a:To></s:Header><s:Body><Divide xmlns="http://tempuri.org/"><Numerator>10</Numerator><Denomirator>2</Denomirator></Divide></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2016-03-16T21:58:37.5323254Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{0e5eea13-016e-4212-b08e-d9881dfaafda}" /><Execution ProcessName="iisexpress" ProcessID="6072" ThreadID="6" /><Channel/><Computer>GO-PC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2016-03-16T22:58:37.5323254+01:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing"><s:Header><a:Action s:mustUnderstand="1">http://tempuri.org/ICalculatorService/DivideResponse</a:Action><a:RelatesTo>urn:uuid:c78a0e9e-1186-4eb8-8ba9-3be6e5125a23</a:RelatesTo></s:Header><s:Body><DivideResponse xmlns="http://tempuri.org/"><DivideResult>5</DivideResult></DivideResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2016-03-16T21:58:40.6895060Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{1543a60f-50e7-459b-a488-ed26f28c4884}" /><Execution ProcessName="iisexpress" ProcessID="6072" ThreadID="6" /><Channel/><Computer>GO-PC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2016-03-16T22:58:40.6895060+01:00" Source="TransportSend" Type="System.ServiceModel.Channels.BodyWriterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPowBKDolyVxNNop2fuGmPMrcAAAAAo2n7OeuCgkyv0zGH+762BAigWWwi6bFBgR7DUXRHSdsACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing"><s:Header><a:Action s:mustUnderstand="1">http://tempuri.org/ICalculatorService/Divide</a:Action><a:MessageID>urn:uuid:10f1e9b4-4f7d-4dd7-8d79-0b20fbb37775</a:MessageID><ActivityId CorrelationId="31777392-d217-40f3-a9f6-ea95e8a79ecc" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">1543a60f-50e7-459b-a488-ed26f28c4884</ActivityId><a:ReplyTo><a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address></a:ReplyTo><a:To s:mustUnderstand="1">http://localhost:8080/CalculatorService</a:To></s:Header><s:Body><Divide xmlns="http://tempuri.org/"><Numerator>10</Numerator><Denomirator>0</Denomirator></Divide></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2016-03-16T21:58:43.3906604Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{1543a60f-50e7-459b-a488-ed26f28c4884}" /><Execution ProcessName="iisexpress" ProcessID="6072" ThreadID="6" /><Channel/><Computer>GO-PC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2016-03-16T22:58:43.3896604+01:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing"><s:Header><a:Action s:mustUnderstand="1">http://schemas.microsoft.com/net/2005/12/windowscommunicationfoundation/dispatcher/fault</a:Action><a:RelatesTo>urn:uuid:10f1e9b4-4f7d-4dd7-8d79-0b20fbb37775</a:RelatesTo></s:Header><s:Body><s:Fault><s:Code><s:Value>s:Receiver</s:Value><s:Subcode><s:Value xmlns:a="http://schemas.microsoft.com/net/2005/12/windowscommunicationfoundation/dispatcher">a:InternalServiceFault</s:Value></s:Subcode></s:Code><s:Reason><s:Text xml:lang="fr-BE">Attempted to divide by zero.</s:Text></s:Reason><s:Detail><ExceptionDetail xmlns="http://schemas.datacontract.org/2004/07/System.ServiceModel" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><HelpLink i:nil="true"></HelpLink><InnerException i:nil="true"></InnerException><Message>Attempted to divide by zero.</Message><StackTrace>   at CalculatorService.CalculatorService.Divide(Int32 Numerator, Int32 Denomirator) in e:\ASP.net tutorial\Asp.net\CalculatorService\CalculatorService\CalculatorService.cs:line 18
   at SyncInvokeDivide(Object , Object[] , Object[] )
   at System.ServiceModel.Dispatcher.SyncMethodInvoker.Invoke(Object instance, Object[] inputs, Object[]&amp; outputs)
   at System.ServiceModel.Dispatcher.DispatchOperationRuntime.InvokeBegin(MessageRpc&amp; rpc)
   at System.ServiceModel.Dispatcher.ImmutableDispatchRuntime.ProcessMessage5(MessageRpc&amp; rpc)
   at System.ServiceModel.Dispatcher.ImmutableDispatchRuntime.ProcessMessage41(MessageRpc&amp; rpc)
   at System.ServiceModel.Dispatcher.ImmutableDispatchRuntime.ProcessMessage4(MessageRpc&amp; rpc)
   at System.ServiceModel.Dispatcher.ImmutableDispatchRuntime.ProcessMessage31(MessageRpc&amp; rpc)
   at System.ServiceModel.Dispatcher.ImmutableDispatchRuntime.ProcessMessage3(MessageRpc&amp; rpc)
   at System.ServiceModel.Dispatcher.ImmutableDispatchRuntime.ProcessMessage2(MessageRpc&amp; rpc)
   at System.ServiceModel.Dispatcher.ImmutableDispatchRuntime.ProcessMessage11(MessageRpc&amp; rpc)
   at System.ServiceModel.Dispatcher.ImmutableDispatchRuntime.ProcessMessage1(MessageRpc&amp; rpc)
   at System.ServiceModel.Dispatcher.MessageRpc.Process(Boolean isOperationContextSet)</StackTrace><Type>System.DivideByZeroException</Type></ExceptionDetail></s:Detail></s:Fault></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2016-03-16T22:02:23.2112335Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{7d4a8223-f474-4a26-91a9-892dc8759c17}" /><Execution ProcessName="iisexpress" ProcessID="4448" ThreadID="9" /><Channel/><Computer>GO-PC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2016-03-16T23:02:23.2082333+01:00" Source="TransportSend" Type="System.ServiceModel.Channels.BodyWriterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPo76Z/sz5NIZFpu/Bw2G+gLQAAAAAMbPSC0bJdkSq8/3MZOtOwrN66G+ySolOgsbPn+6pNw8ACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing"><s:Header><a:Action s:mustUnderstand="1">http://tempuri.org/ICalculatorService/Divide</a:Action><a:MessageID>urn:uuid:f283f9bc-deba-44a7-b435-b40db4a7fc90</a:MessageID><ActivityId CorrelationId="7b50046f-9215-4f99-8ce9-7fd37ac2eabe" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">7d4a8223-f474-4a26-91a9-892dc8759c17</ActivityId><a:ReplyTo><a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address></a:ReplyTo><a:To s:mustUnderstand="1">http://localhost:8080/CalculatorService</a:To></s:Header><s:Body><Divide xmlns="http://tempuri.org/"><Numerator>10</Numerator><Denomirator>2</Denomirator></Divide></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2016-03-16T22:03:01.3824167Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{a926dede-431f-43f2-9058-81aca1515f40}" /><Execution ProcessName="iisexpress" ProcessID="5764" ThreadID="6" /><Channel/><Computer>GO-PC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2016-03-16T23:03:01.3794166+01:00" Source="TransportSend" Type="System.ServiceModel.Channels.BodyWriterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPozHMYz/dVwxAh2Cv9e9DzOMAAAAA9A8VBxhX7kW7O/VVAap7mUQSNAfTxyNAt5Bt6sk92dsACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing"><s:Header><a:Action s:mustUnderstand="1">http://tempuri.org/ICalculatorService/Divide</a:Action><a:MessageID>urn:uuid:f07f530d-e5c9-4ae0-8e28-96168be5cb1d</a:MessageID><ActivityId CorrelationId="2c23aa58-6e11-44c9-937c-8ac9e0f39668" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">a926dede-431f-43f2-9058-81aca1515f40</ActivityId><a:ReplyTo><a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address></a:ReplyTo><a:To s:mustUnderstand="1">http://localhost:8080/CalculatorService</a:To></s:Header><s:Body><Divide xmlns="http://tempuri.org/"><Numerator>10</Numerator><Denomirator>2</Denomirator></Divide></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2016-03-16T22:03:02.5834854Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{a926dede-431f-43f2-9058-81aca1515f40}" /><Execution ProcessName="iisexpress" ProcessID="5764" ThreadID="6" /><Channel/><Computer>GO-PC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2016-03-16T23:03:02.5824854+01:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing"><s:Header><a:Action s:mustUnderstand="1">http://tempuri.org/ICalculatorService/DivideResponse</a:Action><a:RelatesTo>urn:uuid:f07f530d-e5c9-4ae0-8e28-96168be5cb1d</a:RelatesTo></s:Header><s:Body><DivideResponse xmlns="http://tempuri.org/"><DivideResult>5</DivideResult></DivideResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2016-03-16T22:03:04.8586156Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{4b9a9d8f-91ad-4c93-b570-0295af5eb248}" /><Execution ProcessName="iisexpress" ProcessID="5764" ThreadID="7" /><Channel/><Computer>GO-PC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2016-03-16T23:03:04.8586156+01:00" Source="TransportSend" Type="System.ServiceModel.Channels.BodyWriterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPozLMYz/dVwxAh2Cv9e9DzOMAAAAA9A8VBxhX7kW7O/VVAap7mUQSNAfTxyNAt5Bt6sk92dsACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing"><s:Header><a:Action s:mustUnderstand="1">http://tempuri.org/ICalculatorService/Divide</a:Action><a:MessageID>urn:uuid:1e13143b-f51c-48e1-a2ac-12d1048ce93c</a:MessageID><ActivityId CorrelationId="22103cef-fa6a-423c-9974-866a6d612a4a" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">4b9a9d8f-91ad-4c93-b570-0295af5eb248</ActivityId><a:ReplyTo><a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address></a:ReplyTo><a:To s:mustUnderstand="1">http://localhost:8080/CalculatorService</a:To></s:Header><s:Body><Divide xmlns="http://tempuri.org/"><Numerator>10</Numerator><Denomirator>0</Denomirator></Divide></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2016-03-16T22:03:08.7768397Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{4b9a9d8f-91ad-4c93-b570-0295af5eb248}" /><Execution ProcessName="iisexpress" ProcessID="5764" ThreadID="7" /><Channel/><Computer>GO-PC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2016-03-16T23:03:08.7758396+01:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing"><s:Header><a:Action s:mustUnderstand="1">http://schemas.microsoft.com/net/2005/12/windowscommunicationfoundation/dispatcher/fault</a:Action><a:RelatesTo>urn:uuid:1e13143b-f51c-48e1-a2ac-12d1048ce93c</a:RelatesTo></s:Header><s:Body><s:Fault><s:Code><s:Value>s:Receiver</s:Value><s:Subcode><s:Value xmlns:a="http://schemas.microsoft.com/net/2005/12/windowscommunicationfoundation/dispatcher">a:InternalServiceFault</s:Value></s:Subcode></s:Code><s:Reason><s:Text xml:lang="fr-BE">Attempted to divide by zero.</s:Text></s:Reason><s:Detail><ExceptionDetail xmlns="http://schemas.datacontract.org/2004/07/System.ServiceModel" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><HelpLink i:nil="true"></HelpLink><InnerException i:nil="true"></InnerException><Message>Attempted to divide by zero.</Message><StackTrace>   at CalculatorService.CalculatorService.Divide(Int32 Numerator, Int32 Denomirator) in e:\ASP.net tutorial\Asp.net\CalculatorService\CalculatorService\CalculatorService.cs:line 18
   at SyncInvokeDivide(Object , Object[] , Object[] )
   at System.ServiceModel.Dispatcher.SyncMethodInvoker.Invoke(Object instance, Object[] inputs, Object[]&amp; outputs)
   at System.ServiceModel.Dispatcher.DispatchOperationRuntime.InvokeBegin(MessageRpc&amp; rpc)
   at System.ServiceModel.Dispatcher.ImmutableDispatchRuntime.ProcessMessage5(MessageRpc&amp; rpc)
   at System.ServiceModel.Dispatcher.ImmutableDispatchRuntime.ProcessMessage31(MessageRpc&amp; rpc)
   at System.ServiceModel.Dispatcher.MessageRpc.Process(Boolean isOperationContextSet)</StackTrace><Type>System.DivideByZeroException</Type></ExceptionDetail></s:Detail></s:Fault></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent>